Mallcoo-hive (default)> desc probe.probelocdata2;
OK
mac                 	string              	                    
mallid              	bigint              	                    
shopid              	bigint              	                    
retentiontime       	bigint              	                    
in                  	timestamp           	                    
out                 	timestamp           	                    
area                	string              	                    
activity            	string              	                    
floorid             	int                 	                    
date                	string              	                    
	 	 
# Partition Information	 	 
# col_name            	data_type           	comment             
	 	 
date                	string 



select count(distinct mac)
from probe.probelocdata2 
where date = 20171219
and mallid=10024
and area="八吉岛"

435


BI计算所得：
435



小工具计算所得：00:00:00 - 23:59:59
439


本地java测试所得：没有限制时间
441


9699
读取的人数为： 1843
---------------------------
经过reduce1之后的人数为： 1616
---------------------------
经过reduce2之后的人数为： 441


================================================================

为什么 小工具算出的人数 会比 BI系统的人数 多？？？？

找原因：
1.先确定 mr获取的源数据记录数 和 java程序获取的记录数 是否一致？？
查看 20171219 这一天的数据：其中不仅仅有当天的数据，还存在前一天最后5分钟的数据
	mr 计算指标用的源数据就是这些所有的数据
	java 计算指标用的源数据只是当天的数据，不含前一天的数据
	
这是客流人数不同的原因之一！！！

2.统一 mr获取的源数据记录数 和 java程序获取的记录数 （所有数据，含前一天的5分钟的数据）

3.把java处理后的数据结果testresult.csv 放到hdfs上 "/apps/tony_test/probe/probejavatestdata/testresult.csv"

4.创建外部表：
create external table test.probe_java_test(
 mac string
)
location "/apps/tony_test/probe/probejavatestdata"


5.用java处理后的数据 与 mr处理后的数据 进行 join：

select a.mac
  from (  
        select mac
          from test.probe_java_test
         group by mac 
        ) a
  left join (
            select mac
              from probe.probelocdata2 
             where date = 20171219
               and mallid=10024
               and area="八吉岛"
           ) b
    on a.mac = b.mac
 where b.mac is null
 
6.得到20171219 java比mr多出来的人，如下：
 
1c48ce5806f7
3480b3f8fbc0
3cfa432454cahh
70d92307bbc2
8c2505bac2b4
c09f05b28990


7.返回最原始的数据源，随便找一个人，查出他的所有被扫描到记录

select from_unixtime(cast(time as bigint)) as atime, probemac,mac,rssi,date
from probe.probelocdata_imoobox
where date = 20171219
and rssi > -82
and mac = "1c48ce5806f7"
order by atime;


2017-12-19 09:41:59 202818a0f75e    1c48ce5806f7    -81 20171219
2017-12-19 09:48:38 202818a0f7ee    1c48ce5806f7    -24 20171219
2017-12-19 09:51:44 202818a0f7ee    1c48ce5806f7    -24 20171219
2017-12-19 09:52:16 202818a0f75e    1c48ce5806f7    -80 20171219
2017-12-19 09:52:47 202818a0f7ee    1c48ce5806f7    -24 20171219
2017-12-19 12:01:42 202818a0f63e    1c48ce5806f7    -64 20171219
2017-12-19 12:03:03 202818a0f63e    1c48ce5806f7    -76 20171219
2017-12-19 12:03:55 202818a0f4ee    1c48ce5806f7    -75 20171219
2017-12-19 12:04:13 202818a0f646    1c48ce5806f7    -80 20171219
2017-12-19 12:04:41 202818a0f63e    1c48ce5806f7    -81 20171219
2017-12-19 12:06:37 202818a0f63e    1c48ce5806f7    -63 20171219
2017-12-19 12:07:06 202818a0f7be    1c48ce5806f7    -81 20171219
2017-12-19 12:07:54 202818a0f6ea    1c48ce5806f7    -80 20171219
2017-12-19 12:08:07 202818a0f63e    1c48ce5806f7    -64 20171219
2017-12-19 12:10:52 202818a0f75e    1c48ce5806f7    -80 20171219
2017-12-19 13:17:03 202818a0f63e    1c48ce5806f7    -81 20171219
2017-12-19 13:18:08 202818a0f63e    1c48ce5806f7    -79 20171219
2017-12-19 18:21:13 202818a0f7ee    1c48ce5806f7    -33 20171219
2017-12-19 18:23:54 202818a0f7ee    1c48ce5806f7    -51 20171219
2017-12-19 18:27:16 202818a0f7ee    1c48ce5806f7    -24 20171219


8.与 probeinfo 表进行关联，得到所在的 商场，区域等等

select atime,probemac,a.mac, i.mallid, i.shopid,i.area,activity,rssi, date
from (
select from_unixtime(cast(time as bigint)) as atime, probemac, mac,rssi,date
from probe.probelocdata_imoobox
where date = 20171219
and rssi > -82
and mac = "1c48ce5806f7"
) a
JOIN probe.probeinfo i 
  ON probemac=MAC_FORMAT(i.mac,true)
order by atime;
  
2017-12-19 09:41:59	202818a0f75e	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-81	20171219
2017-12-19 09:48:38	202818a0f7ee	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-24	20171219
2017-12-19 09:51:44	202818a0f7ee	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-24	20171219
2017-12-19 09:52:16	202818a0f75e	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-80	20171219
2017-12-19 09:52:47	202818a0f7ee	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-24	20171219                    -- initData
2017-12-19 12:01:42	202818a0f63e	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-64	20171219
2017-12-19 12:03:03	202818a0f63e	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-76	20171219
2017-12-19 12:03:55	202818a0f4ee	1c48ce5806f7	10024	NULL	北8街区	北8街区	-75	20171219
2017-12-19 12:04:13	202818a0f646	1c48ce5806f7	10024	NULL	北3展区	IP展区（北3）	-80	20171219
2017-12-19 12:04:41	202818a0f63e	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-81	20171219
2017-12-19 12:06:37	202818a0f63e	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-63	20171219
2017-12-19 12:07:06	202818a0f7be	1c48ce5806f7	10024	NULL	北8街区	北8街区	-81	20171219
2017-12-19 12:07:54	202818a0f6ea	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-80	20171219
2017-12-19 12:08:07	202818a0f63e	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-64	20171219            -- probelists.get(i)  
2017-12-19 12:10:52	202818a0f75e	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-80	20171219                    -- initData
2017-12-19 13:17:03	202818a0f63e	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-81	20171219
2017-12-19 13:18:08	202818a0f63e	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-79	20171219
2017-12-19 18:21:13	202818a0f7ee	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-33	20171219
2017-12-19 18:23:54	202818a0f7ee	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-51	20171219
2017-12-19 18:27:16	202818a0f7ee	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-24	20171219


9.然后再去代入mr程序，一步步分析其为什么会被过滤掉

2017-12-19 12:01:42	202818a0f63e	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-64	20171219
2017-12-19 12:03:03	202818a0f63e	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-76	20171219

2017-12-19 12:04:41	202818a0f63e	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-81	20171219
2017-12-19 12:06:37	202818a0f63e	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-63	20171219

2017-12-19 12:07:54	202818a0f6ea	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-80	20171219
2017-12-19 12:08:07	202818a0f63e	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-64	20171219            -- probelists.get(i)  

2017-12-19 13:17:03	202818a0f63e	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-81	20171219
2017-12-19 13:18:08	202818a0f63e	1c48ce5806f7	10024	NULL	北1展区	活动展区（北1）	-79	20171219




2017-12-19 09:41:59	202818a0f75e	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-81	20171219
2017-12-19 09:48:38	202818a0f7ee	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-24	20171219
2017-12-19 09:51:44	202818a0f7ee	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-24	20171219
2017-12-19 09:52:16	202818a0f75e	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-80	20171219
2017-12-19 09:52:47	202818a0f7ee	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-24	20171219  

2017-12-19 12:10:52	202818a0f75e	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-80	20171219

2017-12-19 18:21:13	202818a0f7ee	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-33	20171219
2017-12-19 18:23:54	202818a0f7ee	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-51	20171219
2017-12-19 18:27:16	202818a0f7ee	1c48ce5806f7	10024	NULL	八吉岛	八吉岛	-24	20171219

